Repository: michal-tomlein/itest-doc
Catalog: po/*.po
Languages: uk

source: You are now ready to start the server. Click the Start server button or go to the Server menu and select Start server.
uk: Тепер все готово щоб запустити сервер. Натисніть Запустити сервер або увійдіть до меню Сервер та оберіть Запустити сервер.

source: If you haven't configured the printer yet, you will be asked to do so. When you select the printer to use and configure it, you will have to click Print. Don't worry, nothing will be printed yet. This setting will be used when the students finish their tests, in order to print the results. Everything is done automatically, you will be informed about any activity of the printer via the server log.
uk: Якщо ви не маєте налаштованого принтера, iTest попросить налаштувати його. Коли ви оберете принтер та налаштуєте його, ви маєте натиснути Друкувати. Відразу нічого не буде надруковано. Налаштування буде використано, коли студенти закінчать проходження тесту, для друкування результатів. Все проходитиме автоматично, ви будете проінформовані про всю роботу принтера через журнал сервера.

source: If you don't want to print the results and you want to keep them in an electronic form instead (so that you can mail them to the students, for instance), you can use software like PDF Creator (free), Adobe Acrobat or Macromedia FlashPaper (probably the most suitable) and configure iTest to use the virtual printer they provide. Please note that this is only needed under Windows. Computers running Mac OS X and most Linux distributions can create PDF files out-of-the-box.
uk: Якщо ви не хочете друкувати результати і тримати їх лише в електронному вигляді (так ви зможете надіслати їх студентам по електронній пошті), ви можете використати програми типу PDF Creator (вільне ПЗ), Adobe Acrobat чи Macromedia FlashPaper (можливо, більш підхожі) та налаштувати iTest на використання віртуального принтера, що вони надають. Варто зазначити, що це потрібно лише під Windows. Комп'ютери з Mac OS X та більшістю дистрибутивів Linux можуть типово створювати файли PDF.

source: Now you may connect client computers. See the iTestClient documentation for details on how to do this.
uk: Тепер ви можете під'єднати клієнтські комп'ютери. Дивіться документацію до iTestClient за детальними поясненнями як це зробити.

source: Off-line usage
uk: Використання без мережі

source: In case there is no network available, you will need to load the test into each client computer manually:
uk: Якщо немає доступної мережі, ви муситимете завантажити тест на кожен комп'ютер вручну:

source: Set up a server the normal way.
uk: Встановіть сервер звичайним способом.

source: Export a test by going to the Server menu and selecting Export test. Save it to a flash disk or any other kind of removable media. Do not stop the server now!
uk: Експортуйте тест, зайшовши в меню Сервер та обравши Експортувати тест. Збережіть його на флеш-диск або інший змінний носій. Не зупиняйте сервера поки!

source: Plug the media into a client computer.
uk: Вставте носій у клієнтський комп'ютер.

source: Under {\bf Windows}, you can open the Explorer window, go to the folder with your exported test and double click the file. Once it is loaded into iTestClient, you may unplug the media (it is no longer needed) and do the same with the rest of the client computers.
uk: Під {\bf Windows} ви можете відкрити вікно Провідника, перейти до теки з експортованим тестом та двічі клацнути на ньому. Його буде завантажено до iTestClient, тоді ви можете вийняти носій (він більше не потрібен) і зробити те саме на решті клієнтських комп'ютерів.

source: Under {\bf any} other {\bf operating system} (and Windows, if you prefer this way), run iTestClient, manually locate the file on the media and load it. Once it is loaded into iTestClient, you may unplug the media (it is no longer needed) and do the same with the rest of the client computers. For further details on how to do this, see the iTestClient documentation.
uk: Під {\bf будь якими} іншими {\bf операційними системами} (і під Windows, якщо бажаєте), запустіть iTestClient, вручну знайдіть файл на носії та завантажте його. Коли він буде завантажений в iTestClient, можна витягувати носій (він більше не потрібен) та зробити те саме на інших клієнтських комп'ютерах. Для детальнішої інформації про це, дивіться документацію до iTestClient.

source: When the students finish their tests, plug the removable media into each client computer and copy the file, which was generated by iTestClient. By default, it is located in the home directory (under Windows, this is something like {\tt C:\textbackslash{}Documents and Settings\textbackslash{}User}). Preferably, copy all the files from all the client computers into a separate directory on your removable media.
uk: Коли студенти закінчили проходження тесту, вставте змінний носій до кожного комп'ютера та скопіюйте файл, створений iTestClient. Типово, він розташований в теці користувача (у Windows це щось типу {\tt C:\textbackslash{}Documents and Settings\textbackslash{}User}). Краще копіюйте файли з клієнтських комп'ютерів в окремі теки на вашому змінному носії.

source: Plug the removable media into the server. From the Server menu, select Add off-line clients. Select the directory on the removable media with all the clients' files. iTest should load all of them automatically, and their results should be printed. You may now stop the server.
uk: Вставте змінний носій в сервер. У меню Сервер оберіть Додати off-line клієнтів. Оберіть теку на змінному носії з клієнтськими файлами. iTest завантажить їх усі автоматично та роздрукує результати. Тепер ви можете зупинити сервер.

source: Viewing saved sessions
uk: Перегляд збережених сесій

source: In order to be able to view past sessions, you need to check the Save session option the Server menu when the server is running. It will then be saved when you stop the server.
uk: Для того, щоб мати можливість переглянути результати проведених сесій, ви маєте вибрати пункт Зберегти сесію в меню Сервер, коли він запущений. Вона буде збережена, коли ви зупинене сервер.

source: To view a session, switch the view to Saved sessions by clicking the icon in the toolbar. You will see the session in the list of sessions. Double click its item in this list. The session will be loaded and ready for viewing.
uk: Щоб переглянути сесії, перейдіть в Збережені сесії, клацнувши кнопку на панелі інструментів. Ви побачите список попередніх сесій. Двічі клацніть на одній із них. Сесія буде завантажена і готова для перегляду.

source: \sshot{itest-1_0_2-saved_sessions-list}{List of saved sessions}
uk: \sshot{itest-1_0_2-saved_sessions-list}{Список збережених сесій}

source: You can now view the results of a student by clicking a name in the list of students.
uk: Тепер ви можете переглянути результати студента, клацнувши його ім'я в списку студентів.

source: Printing
uk: Друк

source: When you're viewing a saved session, you can also print results of a student, of all students or a summary of the session. In orded to do this, go to the Session menu and click one of the first three options, according to what you want to print. You can only print results of a student if a student is selected in the list of students.
uk: Коли ви переглядаєте збережену сесію, ви можете також роздрукувати результати студента чи всіх студентів, чи підсумок сесії. Для цього, зайдіть до меню Сесія та клацніть один з перших трьох пунктів, залежно від того, що ви хочете роздрукувати. Ви можете роздрукувати результати обраного одного чи декількох студентів.

source: Exporting a log
uk: Експортувати журнал

source: If a session has a log, you can export it as an html document. In order to do this, a session must be loaded. To export a log, go to the Session menu and select the Export log option. Now, choose a name for the file and save it.
uk: Якщо сесія має журнал, ви можете експортувати його як html сторінку. Для цього треба завантажити сесію. Далі зайдіть в меню Сесія та оберіть пункт Експортувати журнал. Тепер уведіть ім'я файлу для збереження та збережіть.

source: Deleting a log
uk: Вилучення журналу

source: When a session log is no longer needed, you can delete it to save disk space. In order to do this, a session must be loaded. To delete a log, go to the Session menu and select the Delete log option. You will be asked to confirm this action.
uk: Коли журнал сесії більше не потрібен, ви можете його вилучити щоб зекономити місце на диску. Для цього завантажте сесію, зайдіть в меню Сесія та оберіть Видалити журнал. iTest запитає підтвердження цієї дії.

source: Archiving, restoring and copying a session
uk: Архівування, відновлення та копіювання сесії

source: In iTest 1.1, a new feature called archive was introduced. The archive can store sessions, which are associated with the database by its name. When you open a database, iTest checks if there are any archived sessions under its name. If so, they are all loaded and you can view them. If you open the same database on a different computer, these sessions will not be shown, because they are only available on the computer where you archive them.
uk: В iTest 1.1 з'явилася можливість створювати архіви. В них можна зберігати сесії, що пов'язані з базою даних за іменем. Коли ви відкриваєте базу, iTest перевіряє, чи є за цим іменем архівовані сесії. За потреби, вони можуть бути завантажені для перегляду. Якщо ви відкриєте цю базу на іншому комп'ютері, ці сесії не будуть показані, тому що вони доступні лише на комп'ютері, де були архівовані.

source: Archiving a session is easy, you just need to load the session you wish to archive, go to the Session menu and select Archive session. You'll see the session jump from the list of sessions to the archive.
uk: Архівування сесії робиться легко, достатньо завантажити її, зайти у меню Сесія та обрати пункт Архівувати сесію. Ви побачите, що сесія перемістилася з списку сесій до архіву.

source: \sshot{itest-1_1_1-saved_sessions-archive}{List of archived sessions}
uk: \sshot{itest-1_1_1-saved_sessions-archive}{Список архівованих сесій}

source: Restoring a session brings it back into the database. To do so, choose Restore session from the Session menu.
uk: Відновлення сесії повертає її назад до бази даних. Для цього оберіть Відновити сесію з меню Сесія.

source: To copy a session to or from the archive, use the appropriate actions in the Session menu.
uk: Щоб скопіювати сесію до чи з архіву, використовуйте відповідні пункти з меню Сесія.

source: Using the statistics
uk: Використання статистики

source: iTest remembers every answer of every student, correct or wrong. The number of correct and incorrect answers is saved in the database along with the question. These numbers are used to determine the difficulty of a question. If available, this information is displayed at the bottom of the editor when you select a question.
uk: iTest пам'ятає кожну відповідь кожного студента, вірну чи хибну. Кількість вірних та хибних відповідей зберігається в базі даних разом із запитанням. Ці числа використовуються щоб визначити важкість даного запитання. Якщо така інформація доступна, вона показується у верхній частині редактора, коли ви обираєте запитання.

source: \sshot{itest-1_0_2-questions-statistics}{Statistics available for a question}
uk: \sshot{itest-1_0_2-questions-statistics}{Доступна статистика для запитання}

source: By clicking \quo{adjust difficulty}, the difficulty of the question is set to the calculated one. You can also adjust the difficulty of all questions in your database. In order to do so, select Overall statistics from the Database menu. A window will appear.
uk: Клацніть по \quo{налаштувати складність} і буде автоматично вирахувана складність питання, виходячи із кількості вірних та хибних відповідей, даних на нього. Ви можете налаштувати складність всіх запитань у вашій базі даних. Для цього оберіть пункт Загальна статистика в меню База даних. З'явиться відповідне вікно.

source: \sshot{itestserver-1_2_0-statistics-window}{Overall statistics for a database}
uk: \sshot{itestserver-1_2_0-statistics-window}{Загальна статистика бази даних}

source: Click Adjust all to change the difficulties of all questions to the calculated ones. You can also change the difficulty of some questions only by clicking the corresponding Adjust difficulty button on the right.
uk: Натисніть Налаштувати все і буде вирахувана складність для всіх запитань. Ви можете також змінювати складність лише деяких питань, клацнувши на кнопці Налаштувати складність навпроти нього.

source: iTestClient is used as a client program. It loads the test created by the server and randomly chooses the questions to form a unique test for the student. It can either connect to the server over a network or load the test from a file exported by the server. When the test is over, the results are saved into a file and if the client is connected over network, they are automatically sent to the server. In case of connection breakdown, the backup file can be used -- it can be loaded back into the server.
uk: iTestClient використовується як клієнтська програма. Він завантажує тест, створений сервером та випадково обирає запитання, формуючи унікальний тест для студента. Він може приєднуватися до сервера через мережу, або завантажувати експортований сервером тест із файлу. Коли тестування закінчено, результати зберігаються в файл, або відсилаються на сервер, якщо клієнт під'єднано до мережі. Якщо стався обрив з'єднання, буде використано файл резервної копії -- він може бути завантажений на сервер.

source: On-line usage
uk: Проведення тестування через мережу

source: First you will need to get a server running. See the iTestServer documentation for further details. You should also know either the IP address of the server or its network name. For each operating system, there is different way to obtain this information, and it is thus beyond the scope of this documentation.
uk: Спершу ви маєте налаштувати та запустити сервер. Дивіться документацію до iTestServer для детальнішої інформації. Ви маєте знати ІР адресу сервера або його мережеве ім'я. Для кожної операційної система є різні шляхи отримання цієї інформації, про це можна почитати в документації по них

source: When the server is running, run iTestClient on a client computer connected to one network with the server. Type the IP address of the server or its name into the Server name field and by pressing Return (Enter) move to the next field. Type the server port in here and press Return (Enter) again. The client should now connect.
uk: Коли сервер запущено, запустіть iTestClient на клієнтському комп'ютері, що під'єднаний до мережі, в якій є сервер. Уведіть ІР адресу сервера або його ім'я в поле Ім'я сервера та, натиснувши Enter, перейдіть до наступного поля. Уведіть порт сервера та натисніть Enter знову. Клієнт здійснить з'єднання.

source: \sshot{itestwri-1_0_2-main-network}{Connecting to an iTest server}
uk: \sshot{itestwri-1_0_2-main-network}{Приєднання до сервера iTest}

source: Setting the output file location
uk: Вибір розташування вихідного файлу

source: The output file contains the answers of the student. It is used in case of connection breakdown or in case there is no network available and the off-line approach is used.
uk: Вихідний файл містить відповіді студента. Він використовується у випадку розриву з'єднання мережі, або у випадку її недоступності.

source: \sshot{itestwri-1_0_2-main-output}{Setting the output file location}
uk: \sshot{itestwri-1_0_2-main-output}{Вибір розташування вихідного файлу}

source: The default location is the home directory of the current user. Under Windows, this is the \\Documents and Settings\\UserName directory.
uk: Типовим розташуванням є домашня тека поточного користувача. У Windows це є тека \\Documents and Settings\\UserName.

source: If you need to specify another location, uncheck the Use default checkbox and click Browse. You shouldn't choose any directory visible to the student, least of all the desktop or the My Documents folder.
uk: Якщо ви хочете вказати інше розташування, зніміть прапорець "Використовувати типові значення" та натисніть Перегляд. Ви не повинні обирати теку, яку бачать студенти, наприклад стільниця чи Документи.

source: Other settings
uk: Інші налаштування

source: \sshot{itestwri-1_1_1-other_settings-hide_question_names}{Hide question names}
uk: \sshot{itestwri-1_1_1-other_settings-hide_question_names}{Показувати номери питань замість їх назв}

source: If you do not want the students to see the names of the questions, check \quo{Hide question names, show numbers instead}. This feature was introduced in iTest 1.1.
uk: Якщо ви хочете, щоб студенти не бачили назв запитань, поставте \quo{Показувати номери питань замість їх назв}. Ця можливість з'явилася в iTest 1.1.

source: \sshot{itestclient-1_3_0-other_settings-do_not_show_correct_answers}{Do not show correct answers}
uk: \sshot{itestclient-1_3_0-other_settings-do_not_show_correct_answers}{Не показувати правильні відповіді}

source: If you do not want correct answers to be displayed at the end of the test, check \quo{Do not show correct answers at the end of the test}. This feature was introduced in iTest 1.3.
uk: Якщо ви не хочете, щоб правильні відповіді відображалися після закінчення тестування, поставте \quo{Не показувати правильних відповідей до закінчення тестування}. Ця можливість з'явилася в iTest 1.3.

source: Testing
uk: Тестування

source: When you have configured the client, it is time to click the Ready button in the lower right corner of the screen.
uk: Після того, як ви налаштували клієнт, можна натиснути кнопку Готовий у нижньому правому кутку.

source: Now is the time for the students to enter the classroom. They sit down in front of a client computer and are presented with the Welcome screen. They type in their name and click Start.
uk: Тепер час впускати студентів до кімнати. Вони сідають за клієнтські комп'ютери та бачать екран привітання. Вони уводять свої імена та натискають Розпочати.

source: They may choose to view the remaining time by clicking Show remaining time in the bottom of the screen. Each time they select an answer, the corresponding question turns green in the list of questions. The green colour does not indicate a correct answer -- just an answer. Whether they're right or wrong, they will be informed at the end of the test (unless you are using the off-line approach, which does not support this).
uk: Вони можуть побачити час, що залишився, клацнувши Показати час, що залишився знизу екрана. Щоразу, коли вони вибирають відповідь, питання в списку підсвічується зеленим. Зелений колір не означає правильної відповіді. Чи відповіді вірні, чи ні, студенти будуть повідомлені по закінченню тесту (при тестуванні в off-line режимі вірні відповіді не показуються.

source: If a certain question contains SVG graphics, it will be displayed below the text of the question. Clicking the blue title of a picture shows it in a separate window, allowing the student to resize it and thus take a closer look at it. This feature was introduced in iTest 1.3.
uk: Якщо певне запитання містить SVG зображення, воно буде показане під текстом запитання. Клацніть по синьому заголовку і зображення буде показане в окремому вікні, дозволяючи студенту збільшити його і краще роздивитися. Це функція з'явилася у iTest 1.3.

source: When they run out of time, the test is automatically ended. In case they are ready sooner than that, they can choose to finish the exam by clicking Finish. They will be asked to confirm this action.
uk: Коли виходить час, тестування автоматично завершується. Якщо студенти закінчать раніше, вони зможуть закінчити тестування, натиснувши Закінчити. Програма запитає їх підтвердження цієї дії.

source: \sshot{itestclient-1_2_0-newtest_button}{New test button}
uk: \sshot{itestclient-1_2_0-newtest_button}{Новий тест}

source: When the test is over, you can start a new one by clicking the New test button. If you are using the off-line approach, the media with the test file must still be connected. This feature was introduced in iTest 1.2.
uk: Коли тест закінчено, ви можете запустити новий, клацнувши кнопку Новий тест. Якщо ви працюєте без мережі, потрібно вставити носій з файлом тесту. Ця функція з'явилася в iTest 1.2.
