Repository: michal-tomlein/itest-doc
Catalog: po/*.po
Languages: uk

source: english
uk: українська

source: Computerised examination made easy \vspace{0.05in} \hrule
uk: Комп'ютерне тестування - це просто \vspace{0.05in} \hrule

source: \vspace{0.2in} Version \itestminorversion
uk: \vspace{0.2in} Версія \itestminorversion

source: \hrule \vspace{0.05in} Author: Michal Tomlein
uk: \hrule \vspace{0.05in} Автор: Michal Tomlein

source: Last updated: \today
uk: Востаннє оновлено: \today

source: Introduction
uk: Введення

source: iTestServer offers an easy way to organise a database of questions and answers. It makes use of colours in a way that makes this even easier. It features a simple rich text editor that allows you to format your questions just the way you like.
uk: iTestServer дозволяє легко впорядковувати базу даних запитань та відповідей. Це досягається за допомогою використання кольорів. Наявний простий текстовий редактор, що дозволяє здійснювати форматування тексту запитань.

source: iTestServer is also used as the server, to which client computers then connect in order to retrieve a test. It can save test sessions for later viewing and allows you to view and print statistics.
uk: iTestServer також використовується як сервер, до якого під'єднуються клієнтські комп'ютери для отримання тесту. Він може зберігати тестові сесії для подальшого перегляду та дозволяє вам друкувати та переглядати статистику.

source: User interface
uk: Інтерфейс користувача

source: \sshot{itestserver-1_2_0-main-top}{The menu bar and the tool bar}
uk: \sshot{itestserver-1_2_0-main-top}{Головне меню та панель інструментів}

source: The menu bar provides access to different actions, like opening, saving and closing a database in the File menu, actions related to the current view and language in the View menu, database statistics and other database-related actions in the Database menu or a link to this documentation and an update checker in the Help menu.
uk: Головне меню дозволяє виконувати різні дії, зокрема відкривати, зберігати та закривати базу даних в меню "Файл", дії, пов'язані з виглядом та мовою в меню "Вигляд", переглядати статистику бази даних та інші дії, пов'язані з цим, в меню "База даних", посилання на цю документацію та перевірка на оновлення в меню "Довідка".

source: The tool bar features icons for actions that can also be found in the menus. The most notable ones are the five checkable icons which follow the Save button. You can use these to switch view to editing questions (Questions), writing notes (Comments), creating flags (Flags), configuring and running the server (Server mode) and viewing saved sessions (Saved sessions). Of course, this only works when a database is open.
uk: Панель інструментів містить кнопки дій, що також є в головному меню. Найбільш вживані п'ять команд розташовані за кнопкою "Зберегти". Ви можете використовувати їх для перемикання в режим редагування запитань (Питання), написання нотаток (Коментарі), створення категорії (Категорії), налаштування та запуск сервера (Режим сервера) та перегляд збережених результатів (Збережені сесії). Ці кнопки працюють лише тоді, коли будь яка база даних відкрита.

source: \sshot{itestserver-1_2_0-questions-top}{The menu bar and the tool bar when a database is open}
uk: \sshot{itestserver-1_2_0-questions-top}{Головне меню та панель інструментів та відкрита база даних}

source: The middle part of the window features a list of recently used databases.
uk: В середній частині вікна показано список баз даних, що були відкриті останніми.

source: \sshot{itest-1_0_2-main-list}{Recently used databases}
uk: \sshot{itest-1_0_2-main-list}{Останні бази даних}

source: Creating a database
uk: Створення бази даних

source: To create a new database, click the New button in the File menu, in the tool bar or under the list of recent databases. Type in a name for the database. Please choose wisely, this name shouldn't be too long and should represent the content of the database well. After this, choose a name for the database file.
uk: Щоб створити нову базу даних, клацніть на кнопку "Нова" на панелі інструментів, або оберіть відповідний пункт із меню "Файл". Уведіть ім'я бази даних. Будь ласка, називайте розсудливо, ім'я не має бути надто довгим і повинно відображати вміст бази даних. Після цього, уведіть ім'я файлу бази даних.

source: You can always change the database name later (although it's not recommended).
uk: Ви можете змінити ім'я бази даних пізніше (не рекомендовано)

source: \sshot{itestserver-1_4_0-questions-dbi-name}{Database name}
uk: \sshot{itestserver-1_4_0-questions-dbi-name}{Ім'я бази даних}

source: The database also contains a date, which you can set to be the date of the last save, or to stay the same permanently (this is useful, if you want to keep the date when you created the database).
uk: База даних може зберігати дату останньої зміни, або залишати попередню. (це потрібно, якщо ви хочете зберегти дату створення бази даних)

source: \sshot{itest-1_0_2-questions-dbi-date}{Database date}
uk: \sshot{itest-1_0_2-questions-dbi-date}{Дата бази даних}

source: Editing questions
uk: Зміна запитань

source: To create a new question, you can either go to the Question menu and click Add, or click Add in the tool bar or below the list of questions. Type in a name for the question -- this name should not give a hint about the answer of the question. It should be a unique, descriptive name for the question which will remind you about the topic of the question.
uk: Щоб створити нове запитання, клацніть "Добавити" в меню "Питання" , або на панелі інструментів, або під списком запитань. Уведіть ім'я для запитання - воно має бути коротким і не давати підказок до нього. Ім'я, також, не має повторюватися, бути інформативним щодо теми самого запитання.

source: The new question will appear in the list of questions.
uk: Нове запитання з'явиться в списку.

source: \sshot{itest-1_0_2-questions-filtered2-list-top}{List of questions}
uk: \sshot{itest-1_0_2-questions-filtered2-list-top}{Список запитань}

source: This list can be filtered, which is useful when you have a lot of questions, maybe even hundreds of them. There are 5 radio buttons at the top. The first of them that says All shows all questions (unless the Search field is yellow or red), the second one with the green icon shows easy questions only, the third button (the orange one) questions with medium difficulty only, the fourth (the red one) difficult questions only and finally the fifth with the flag icon shows questions with a selected flag only (you can select the flag in the combo box below it). If you type a keyword into the Search field, it turns yellow if any question matches your search or red if none found.
uk: Список може бути відфільтрованим, що корисно коли ви маєте багато запитань, скажімо, декілька сотень. Зверху є 5 перемикачів. Перший показує всі запитання, другий, зелений - тільки легкі, третій (оранжевий) - середні, четвертий (червоний) - важкі та останній, з прапорцем, показує запитання лише обраної категорії, яку ви можете вказати у комбосписку нижче. Якщо ви уведете ключове слово в поле пошуку, воно стане жовтим, якщо є відповідні цьому слову питання, або червоним, якщо немає.

source: \sshot{itest-1_0_2-questions-filtered2-list-bottom}{Buttons below the list of questions}
uk: \sshot{itest-1_0_2-questions-filtered2-list-bottom}{Кнопки під списком запитань}

source: Below the list, there are several buttons. They are shortcuts for actions located in the Question menu. They mean Add, Duplicate, Delete, Move up and Move down, respectively.
uk: Під списком є декілька кнопок. Вони відповідають діям із меню "Питання". Ними можна додати, дублювати, вилучити запитання та рухати їх уверх чи вниз по списку.

source: When you select a question to edit, it will appear on the right side of this list, in a section called Selected question. Here you can type in the text of the question, its answers and select the correct one(s).
uk: Коли ви обираєте запитання, щоб змінити його, воно з'являється справа від списку в секції "Обране питання". Тут ви можете увести текст запитання, варіанти відповідей та обрати вірний(і) з них.

source: \sshot{itestserver-1_4_0-questions-edit}{Question editor}
uk: \sshot{itestserver-1_4_0-questions-edit}{Редактор запитань}

source: The topmost part of this section allows you to change its name, flag and difficulty.
uk: Верхня частина цієї секції дозволяє задати його ім'я, категорію та важкість.

source: \sshot{itestserver-1_2_0-questions-edit-basic}{Question name, flag, group and difficulty}
uk: \sshot{itestserver-1_2_0-questions-edit-basic}{Ім'я запитання, категорія та важкість}

source: Below this, you can see the basic formatting tools. The first two buttons allow you to revert the last action (left arrow) or redo a reverted action (right arrow). There's one combo box for choosing a font and one for the font size. Then there are buttons for switching to bold (B), italic (I) and underlined (U) text. Next to these, there is a button for choosing the colour of the text. And finally, L stands for align left, C for centre, R for right and J for justify.
uk: Нижче ви можете побачити стандартну панель форматування. Перші дві кнопки дозволяють скасувати та повернути останню дію (ліва та права стрілки). Далі - комбосписки для зміни шрифту та розміру тексту. Далі є кнопки для вмикання напівжирного (Ж), курсиву (К) та підкресленого (Ч) накреслення. Наступна кнопка дозволяє обрати колір тексту. І останні кнопки вирівнюють по лівому (Л), правому (П) краях, по центру (Ц) та по ширині тексту (Ш)

source: \sshot{itest-1_0_2-questions-edit-formatting}{Text formatting options}
uk: \sshot{itest-1_0_2-questions-edit-formatting}{Кнопки форматування тексту}

source: Attachments allow you to add graphics (Scalable Vector Graphics) to questions. You can use programs such as Inkscape to create an SVG and then import it into iTest by clicking the plus button. To remove an attachment, select it and click the minus button. If you need to change an SVG item (either its name or the actual image), click the edit button located next to the minus button. The last button in the row allows you to export an SVG from iTest, which is useful if you've deleted the original SVG file and want to make changes to it. SVG support was introduced in iTest 1.3.
uk: Вкладення дозволяють вам додавати графіку в форматі SVG (масштабована векторна графіка) до запитань. Можна скористатися програмами типу Inkscape для створення SVG та імпортувати її до iTest. Щоб вилучити вкладення, оберіть його та натисніть кнопку з мінусом. Остання кнопка в ряду дозволяє експортувати SVG з iTest, що згодиться, коли ви видалили оригінальний файл, або хочете зробити зміни у вкладенні. Підтримка SVG з'явилася в iTest 1.3.

source: \sshot{itestserver-1_3_0-questions-edit-svg_tools}{SVG tools}
uk: \sshot{itestserver-1_3_0-questions-edit-svg_tools}{інструменти SVG}

source: Do not forget to click Apply or Save after any change you make to a question, because otherwise it will not be saved.
uk: Не забувайте натиснути Застосувати або Зберегти після того, як ви внесли зміни до запитання, інакше вони будуть втрачені.

source: Printing questions and tests
uk: Друк запитань та тестів

source: When you've created a database with several questions, you may want to print them. In order to do so, go to the Database menu and select Print questions. A window will show up.
uk: Створивши базу даних із кількома запитаннями, ви можете їх роздрукувати. Для цього зайдіть до меню База даних та оберіть Друкувати питання. З'явиться вікно друку.

source: \sshot{itestserver-1_3_0-print_questions}{Print questions dialogue window}
uk: \sshot{itestserver-1_3_0-print_questions}{Вікно друку запитань}

source: If you want all questions to be printed, simply click Add all. If you want to print questions with a specific flag or flags, select Flags (this is the default) and double click the desired flags. If you want to select questions to print manually, select Questions and double click any question you want to print.
uk: Якщо ви хочете друкувати всі питання, натисніть Добавити все. Якщо треба друкувати питання з обраних категорій, оберіть Категорії та двічі клацніть по потрібним категоріям. Якщо ви хочете обрати запитання для друку вручну, Питання та двічі клацніть по потрібних питаннях.

source: If you want to specify advanced options, check the checkbox labelled Advanced. If Print statistics is checked, statistics will be printed for each question which has already been used in a test. If you want to disable formatting, uncheck Print formatted questions. If you want to use the print-outs for testing purposes, be sure to check Print a test. This way, correct answers will not be highlighted. Lastly, if you want to print SVG attachments, check Print graphics.
uk: Якщо ви хочете визначити додаткові налаштування, поставте прапорець Додатково. Якщо обрано Друк статистики, вона буде надрукована на кожне запитання, яке було використане в тестуванні. Якщо ви хочете вимкнути форматування, зніміть прапорець Друк відформатованих питань. Якщо ви хочете використовувати роздруківки з метою тестування - відмітьте Друкувати тест. В цьому разі не буде позначено вірних відповідей. Врешті, якщо ви хочете друкувати SVG вкладення, позначте Друкувати графіку.

source: Support for printing was introduced in iTest 1.3.
uk: Підтримка друку з'явилася в iTest 1.3.

source: Comments
uk: Коментарі

source: Use comments to write down anything you want. This could be reminders, notes, to-dos and so on. Comments are saved within the database file and are therefore unique for each database.
uk: Використовуйте коментарі щоб писати все, що ви захочете. Це можуть бути нагадування та нотатки. Коментарі зберігаються в файлі бази даних, тому є унікальними для кожної із них.

source: You can even use the formatting tools to make your notes look better.
uk: Ви можете використовувати інструменти форматування, щоб зробити коментарі кращими на вигляд.

source: \sshot{itestserver-1_2_0-comments-formatting}{Comments editor}
uk: \sshot{itestserver-1_2_0-comments-formatting}{Редактор коментарів}

source: Using flags
uk: Використання категорій

source: Imagine you have a database of questions from biology. These need to be divided into several categories, for example fauna and flora. You can do this with flags.
uk: Припустимо, ви маєте базу запитань з біології. Її можна розділити на декілька типів, наприклад - фауна та флора. Це можна зробити за допомогою Категорій.

source: To create a new flag, click a checkbox next to an empty field.
uk: Щоб створити нову категорію, поставте прапорець коло наступного порожнього поля.

source: \sshot{itest-1_0_2-flags-checkbox}{An empty flag}
uk: \sshot{itest-1_0_2-flags-checkbox}{Порожня категорія}

source: Next, type in a name. \quo{Biology - fauna} is a good example. If this is the first flag you created, all questions will automatically be assigned this flag. If there are any questions assigned, you can no longer disable the flag (because it is \quo{in use}).
uk: Далі, уведіть ім'я. \quo{Біологія - фауна}, наприклад. Це перша категорія, що ви створили, тому всі питання будуть автоматично призначені до неї. Якщо було призначено хоч одне запитання, ви не зможете вилучити цюкатегорію, як таку, що використана.

source: \sshot{itestserver-1_2_0-flags-disabledcheckbox}{A flag which has been assigned to one question}
uk: \sshot{itestserver-1_2_0-flags-disabledcheckbox}{Категорія, до якої було призначено одне питання}

source: Each flag has a different colour and any question with that flag has the same colour as well. Flags are also useful when you want to set up a test with only those questions that are assigned a certain flag.
uk: Кожна категорія має свій колір і питання, що до неї належать, також матимуть цей колір. Категорії також корисні, коли ви хочете софрмувати тест, що складається з питань, належних одній категорії.

source: Setting up a server
uk: Налаштування сервера

source: To hold a test session, you will need to set up the server. It is recommended to have a printer connected to this server. Click the Server mode button in the tool bar.
uk: Щоб провести тестування, ви маєте налаштувати та запустити сервер. Рекомендовано мати підключений до сервера принтер. Натисніть кнопку Режим сервера на панелі інструментів.

source: Now you have several options. {\bf You can:}
uk: Ви маєте декілька налаштувань. {\bf Ви можете:}

source: {\bf set up a session using all the questions in the database.}\\ Leave the Advanced checkbox unchecked. \inlineimg{itest-1_0_2-server_settings-advanced_unchecked} Proceed to step 2.
uk: {\bf провести тестування всіма наявними питаннями}\\ Залиште вимкненим прапорець Додатково. \inlineimg{itest-1_0_2-server_settings-advanced_unchecked} Перейдіть до кроку 2.

source: {\bf set up a session using only those questions, which have a certain flag or flags.}\\ Check the Advanced checkbox. \inlineimg{itest-1_0_2-server_settings-advanced_checked} Select flags. \inlineimg{itest-1_0_2-server_settings-advanced-flags_radiobutton}\\ Move those flags, which you want to use in the test, into the Used list by selecting them and clicking the right arrow. \inlineimg{itest-1_0_2-server_settings-advanced-rightarrow}\\ If you want, you can also set a separate pass mark (i.e. minimum number of correct answers to pass the test) for each flag. iTest will make sure each student is asked a sufficient amount of questions with a flag for which a pass mark is specified (a value higher than 0), so that each student has a chance to pass. To pass the test, each condition must be fulfilled, that means all the pass marks specified here and the global pass mark (see step 2). This feature was introduced in iTest 1.2.\\\\ \img{itestserver-1_2_0-server_settings-advanced-flags-passmarks}{scale=\sshotscale}
uk: {\bf провести тестування, використовуючи тільки питання із даної категорії чи категорій.}\\ Поставте прапорець Додатково. \inlineimg{itest-1_0_2-server_settings-advanced_checked} Оберіть категорії. \inlineimg{itest-1_0_2-server_settings-advanced-flags_radiobutton}\\ Перенесіть категорії, які ви хочете використати в тестуванні, до списку Використано, обравши їх та клацнувши по стрілці вправо. \inlineimg{itest-1_0_2-server_settings-advanced-rightarrow}\\ Також ви можете встановити оцінку проходження (тобто мінімальну кількість правильних відповідей) на кожну категорію. iTest перевірить, чи відповів кожен студент на певну кількість питань з категорії, для якої вказано поріг проходження (значення більше за 0), щоб кожен студент має шанси пройти. Щоб тест вважався пройденим, повинні бути виконані всі умови, тобто набрати всі вказані бали проходження та загальний бал (див. крок 2). Ця можливість з'явилася в iTest 1.2.\\\\ \img{itestserver-1_2_0-server_settings-advanced-flags-passmarks}{scale=\sshotscale}

source: {\bf set up a session using only manually selected questions.}\\ Check the Advanced checkbox. \inlineimg{itest-1_0_2-server_settings-advanced_checked} Select questions. \inlineimg{itest-1_0_2-server_settings-advanced-questions_radiobutton}\\ Move those questions, which you want to use in the test, into the Used list by selecting them and clicking the right arrow. \inlineimg{itest-1_0_2-server_settings-advanced-rightarrow}
uk: {\bf провести тестування з питаннями, обраними вручну.}\\ Поставте прапорець Додатково. \inlineimg{itest-1_0_2-server_settings-advanced_checked} Оберіть питання. \inlineimg{itest-1_0_2-server_settings-advanced-questions_radiobutton}\\ Перемістіть ці питання, що ви хочете використати в тесті, до списку Використано, виділяючи їх та клацаючи по стрілці вправо. \inlineimg{itest-1_0_2-server_settings-advanced-rightarrow}

source: Below, there are several parameters to set.
uk: Нижче можна встановити декілька параметрів.

source: Test name:
uk: Назва тесту:

source: Unless you want to specify a custom test name, you may leave the checkbox unchecked. The database name will be used as the test name. However, if you do want to specify a custom test name, check the checkbox and type in a name into the field next to it.\\\\ \img{itest-1_0_2-server_settings-test_name}{scale=\sshotscale}
uk: Якщо ви не хочете уводити довільну назву тесту, залиште цей прапорець не виставленим. Буде використано ім'я бази даних як ім'я тесту. Якщо ви хочете вказати довільне ім'я тесту, поставте прапорець і уведіть ім'я до текстового поля, що поруч.\\\\ \img{itest-1_0_2-server_settings-test_name}{scale=\sshotscale}

source: Number of questions:
uk: Кількість запитань:

source: Here you can choose the number of questions each student will be asked. The questions will be chosen automatically (limited only by your settings from step 1), different for each student (if not possible, at least in a different order). You may also choose to use all available questions by selecting \quo{maximum}.\\\\ \img{itest-1_0_2-server_settings-num_of_questions}{scale=\sshotscale}
uk: Ви можете виставити кількість запитань, які будуть задані студентам. Питання будуть обрані автоматично (обмежені лише вашими налаштуваннями з кроку 1), різні для всіх студентів (якщо не можливо, то, принаймні, в різному порядку). Ви можете обрати використання всіх наявних запитань, обравши \quo{maximum}.\\\\ \img{itest-1_0_2-server_settings-num_of_questions}{scale=\sshotscale}

source: Groups:
uk: Групи:

source: Check this checkbox to allow a single question per group to appear in one test only. This means that once a question from a group is randomly chosen, no other questions from the same group may be chosen. If you have some groups with more questions, checking this checkbox will cause the maximum number of questions to decrease, because each group then acts as a single question. This feature was introduced in iTest 1.2.\\\\ \img{itestserver-1_2_0-server_settings-groups}{scale=\sshotscale}
uk: Поставте прапорець, щоб дозволити щоб одне запитання з групи з'являлося тільки в одному тесті. Це значить, що буде довільно обране одне запитання з певної групи і інші питання з неї не будуть показані. Якщо ви маєте небагато груп із багатьма питаннями, виставляння цього прапорця означає зменшення максимальної кількості запитань, так як з одної групи буде показано лише одне. Ця опція з'явилася в iTest 1.2.\\\\ \img{itestserver-1_2_0-server_settings-groups}{scale=\sshotscale}

source: Pass mark:
uk: Оцінка проходження:

source: Here you can choose the minimum number of correct answers the student must have in order to pass the exam.\\\\ \img{itest-1_0_2-server_settings-pass_mark}{scale=\sshotscale}
uk: Тут ви можете вказати мінімальну кількість вірних відповідей, які повинен дати студент щоб пройти тест.\\\\ \img{itest-1_0_2-server_settings-pass_mark}{scale=\sshotscale}

source: Time:
uk: Час:

source: You may choose to specify a certain exam time by selecting \quo{(Time for) the whole test} and specifying the time. However, you can also specify the time per question, which will then be multiplied by the number of questions in the test in order to obtain the total exam time. This is useful, when you want to say, that students should have, say, one minute for each question. This will not prevent the students from using 1 minute 30 seconds of their time for one question and 30 seconds for another.\\\\ \img{itest-1_0_2-server_settings-time}{scale=\sshotscale}
uk: Ви маєте вказати час, даний на проходження тесту \quo{(Час ) весь тест} увівши його. Також, ви можете задавати час, відведений на одне запитання, який буде помножено на кількість питань в тесті, щоб отримати загальний час тестування. Це корисно, коли ви хочете сказати студентам, що вони мають по хвилині на запитання. Це не заборонить студентам використати 1 хвилину 30 секунд їхнього часу на одне запитання та 30 секунд на інше.\\\\ \img{itest-1_0_2-server_settings-time}{scale=\sshotscale}
